breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
        <register>
          <name>CSR</name>
          <addressOffset>0x304</addressOffset>
          <fields>
            <field>
              <name>ADRDY_MST</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EOSMP_MST</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EOC_MST</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EOS_MST</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVR_MST</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>JEOC_MST</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>JEOS_MST</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AWD1_MST</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AWD2_MST</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AWD3_MST</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADRDY_SLV</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EOSMP_SLV</name>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EOC_SLV</name>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EOS_SLV</name>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OVR_SLV</name>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>JEOC_SLV</name>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>JEOS_SLV</name>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AWD1_SLV</name>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AWD2_SLV</name>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>AWD3_SLV</name>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <addressOffset>0x308</addressOffset>
          <fields>
            <field>
              <name>DUAL</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>DELAY</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DMACFG</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>MDMA</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>CKMODE</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PRESC</name>
              <bitRange>[21:18]</bitRange>
            </field>
            <field>
              <name>VREFEN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>VSENSESEL</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>BUFFER_EN</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>BUFFER_SEL_CR</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>BUFFER_CAL_CR</name>
              <bitRange>[26:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CDR</name>
          <addressOffset>0x30C</addressOffset>
          <fields>
            <field>
              <name>RDATA_MST</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RDATA_SLV</name>
              <bitRange>[31:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC1">
      <name>ADC2</name>
      <baseAddress>0x40012800</baseAddress>
      <interrupt>
        <name>ADC2</name>
        <description>ADC2 global Interrupt</description>
        <value>19</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>COMP1</name>
      <groupName>COMP</groupName>
      <baseAddress>0x40016C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>COMP1</name>
        <description>COMP1 global Interrupt</description>
        <value>47</value>
      </interrupt>
      <registers>
        <register>
          <name>CSR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>INNSEL</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>INPSEL</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>WINMODE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BLANKSEL</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>POLARITY</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>HYST</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>COMP_VCDIV_EN</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PWRMODE</name>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>COMP_VCDIV</name>
              <bitRange>[27:20]</bitRange>
            </field>
            <field>
              <name>COMP_VCSEL</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>TIM_EXTI_OUT_SEL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>COMP1_OUT</name>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LOCK</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FLTEN1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLTCNT1</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
