breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP2</name>
      <baseAddress>0x40016C10</baseAddress>
      <interrupt>
        <name>COMP2</name>
        <description>COMP2 global Interrupt</description>
        <value>48</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP3</name>
      <baseAddress>0x40016C20</baseAddress>
      <interrupt>
        <name>COMP3</name>
        <description>COMP3 global Interrupt</description>
        <value>49</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="COMP1">
      <name>COMP4</name>
      <baseAddress>0x40016C30</baseAddress>
      <interrupt>
        <name>COMP4</name>
        <description>COMP4 global Interrupt</description>
        <value>50</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <baseAddress>0x40023000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>CRC data</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>IDR</name>
              <description>CRC independent data</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>RESET</name>
              <description>CRC software reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC</name>
      <baseAddress>0x40007400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x70</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DAC</name>
        <description>DAC global Interrupt</description>
        <value>20</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>EN1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TEN1</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TSEL1</name>
              <bitRange>[6:3]</bitRange>
            </field>
            <field>
              <name>WAVE1</name>
              <bitRange>[8:7]</bitRange>
            </field>
            <field>
              <name>MAMP1</name>
              <bitRange>[12:9]</bitRange>
            </field>
            <field>
              <name>DMAEN1</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DMAUDRIE1</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>EN2</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TEN2</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>TSEL2</name>
              <bitRange>[22:19]</bitRange>
            </field>
            <field>
              <name>WAVE2</name>
              <bitRange>[24:23]</bitRange>
            </field>
            <field>
              <name>MAMP2</name>
              <bitRange>[28:25]</bitRange>
            </field>
            <field>
              <name>DMAEN2</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>DMAUDRIE2</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRIGR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SWTRIG1</name>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SWTRIG2</name>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R1</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L1</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <bitRange>[15:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R1</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R2</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L2</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <bitRange>[15:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R2</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>DACC2DHR</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12RD</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>DACC2DHR</name>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12LD</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <bitRange>[15:4]</bitRange>
            </field>
            <field>
              <name>DACC2DHR</name>
              <bitRange>[31:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8RD</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>DACC1DHR</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>DACC2DHR</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR1</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>DACC1DOR</name>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DAC_CMPOUT</name>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR2</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>DACC2DOR</name>
              <bitRange>[11:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>DMAUDR1</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DMAUDR2</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OC</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>DAC_EXTEN</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>DAC_EXTSRC_CR</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DAC_VREFSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DAC_INTER1_CR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DAC_INTER2_CR</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DAC_CALMODE</name>
              <bitRange>[8:7]</bitRange>
            </field>
            <field>
              <name>DAC_EXTCH_CR</name>
              <bitRange>[10:9]</bitRange>
            </field>
            <field>
              <name>DAC_OS_TRIMCR</name>
              <bitRange>[29:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPCFGR1</name>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>RAMPREFS1</name>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>RAMPHSTEPVALS1</name>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPCFGR2</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>RAMPREFS2</name>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>RAMPHSTEPVALS2</name>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPDLYS</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>RAMPDELAY_EN1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RAMPDELAYDATA1</name>
              <bitRange>[12:1]</bitRange>
            </field>
            <field>
              <name>RAMPDELAY_EN2</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RAMPDELAYDATA2</name>
              <bitRange>[28:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RAMPCR</name>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>RAMPLOADSEL1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RAMPUPTRIGSEL1</name>
              <bitRange>[4:1]</bitRange>
            </field>
            <field>
              <name>RAMPSTPTRIGSEL1</name>
              <bitRange>[8:5]</bitRange>
            </field>
            <field>
              <name>RAMPLOADSEL2</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RAMPUPTRIGSEL2</name>
              <bitRange>[20:17]</bitRange>
            </field>
            <field>
              <name>RAMPSTPTRIGSEL2</name>
              <bitRange>[24:21]</bitRange>
            </field>
          </fields>
        </register>
