breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
        <register>
          <name>NDAT2</name>
          <addressOffset>0x9C</addressOffset>
          <fields>
            <field>
              <name>ND32</name>
              <description>New Data32</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ND33</name>
              <description>New Data33</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ND34</name>
              <description>New Data34</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ND35</name>
              <description>New Data35</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ND36</name>
              <description>New Data36</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ND37</name>
              <description>New Data37</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ND38</name>
              <description>New Data38</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ND39</name>
              <description>New Data39</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ND40</name>
              <description>New Data40</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ND41</name>
              <description>New Data41</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ND42</name>
              <description>New Data42</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ND43</name>
              <description>New Data43</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ND44</name>
              <description>New Data44</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ND45</name>
              <description>New Data45</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ND46</name>
              <description>New Data46</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ND47</name>
              <description>New Data47</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ND48</name>
              <description>New Data48</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ND49</name>
              <description>New Data49</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ND50</name>
              <description>New Data50</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ND51</name>
              <description>New Data51</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ND52</name>
              <description>New Data52</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ND53</name>
              <description>New Data53</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ND54</name>
              <description>New Data54</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ND55</name>
              <description>New Data55</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ND56</name>
              <description>New Data56</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ND57</name>
              <description>New Data57</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ND58</name>
              <description>New Data58</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ND59</name>
              <description>New Data59</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ND60</name>
              <description>New Data60</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ND61</name>
              <description>New Data61</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ND62</name>
              <description>New Data62</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ND63</name>
              <description>New Data63</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF0C</name>
          <addressOffset>0xA0</addressOffset>
          <fields>
            <field>
              <name>F0SA</name>
              <description>Rx FIFO 0 Start Address</description>
              <bitRange>[5:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F0S</name>
              <description>Rx FIFO 0 Size</description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F0WM</name>
              <description>Rx FIFO 0 Watermark</description>
              <bitRange>[30:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F0OM</name>
              <description>FIFO 0 Operation Mode</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF0S</name>
          <addressOffset>0xA4</addressOffset>
          <fields>
            <field>
              <name>F0FL</name>
              <description>Rx FIFO 0 Fill Level</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F0GI</name>
              <description>Rx FIFO 0 Get Index</description>
              <bitRange>[13:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F0PI</name>
              <description>Rx FIFO 0 Put Index</description>
              <bitRange>[21:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F0F</name>
              <description>Rx FIFO 0 Full</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RF0L</name>
              <description>Rx FIFO 0 Message Lost</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF0A</name>
          <addressOffset>0xA8</addressOffset>
          <fields>
            <field>
              <name>F0AI</name>
              <description>Rx FIFO 0 Acknowledge Index</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXBC</name>
          <addressOffset>0xAC</addressOffset>
          <fields>
            <field>
              <name>RBSA</name>
              <description>Rx Buffer Start Address</description>
              <bitRange>[15:2]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF1C</name>
          <addressOffset>0xB0</addressOffset>
          <fields>
            <field>
              <name>F1SA</name>
              <description>Rx FIFO 1 Start Address</description>
              <bitRange>[5:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F1S</name>
              <description>Rx FIFO 1 Size</description>
              <bitRange>[22:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F1WM</name>
              <description>Rx FIFO 1 Watermark</description>
              <bitRange>[30:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F1OM</name>
              <description>FIFO 1 Operation Mode</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF1S</name>
          <addressOffset>0xB4</addressOffset>
          <fields>
            <field>
              <name>F1FL</name>
              <description>Rx FIFO 1 Fill Level</description>
              <bitRange>[6:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F1GI</name>
              <description>Rx FIFO 1 Get Index</description>
              <bitRange>[13:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F1PI</name>
              <description>Rx FIFO 1 Put Index</description>
              <bitRange>[21:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F1F</name>
              <description>Rx FIFO 1 Full</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RF1L</name>
              <description>Rx FIFO 1 Message Lost</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DMS</name>
              <description>Debug Message Status</description>
              <bitRange>[31:30]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXF1A</name>
          <addressOffset>0xB8</addressOffset>
          <fields>
            <field>
              <name>F1AI</name>
              <description>Rx FIFO 1 Acknowledge Index</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXESC</name>
          <addressOffset>0xBC</addressOffset>
          <fields>
            <field>
              <name>F0DS</name>
              <description>Rx FIFO 0 Data Field Size</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>F1DS</name>
              <description>Rx FIFO 1 Data Field Size</description>
              <bitRange>[6:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RBDS</name>
              <description>Rx Buffer Data Field Size</description>
              <bitRange>[10:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBC</name>
          <addressOffset>0xC0</addressOffset>
          <fields>
            <field>
              <name>TBSA</name>
              <description>Tx Buffers Start Address</description>
              <bitRange>[15:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NDTB</name>
              <description>Number of Dedicated Transmit Buffers</description>
              <bitRange>[21:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFQS</name>
              <description>Transmit FIFO/Queue Size</description>
              <bitRange>[29:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFQM</name>
              <description>Tx FIFO/Queue Mode</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXFQS</name>
          <addressOffset>0xC4</addressOffset>
          <fields>
            <field>
              <name>TFFL</name>
              <description>Tx FIFO Free Level</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFGI</name>
              <description>Tx FIFO Get Index</description>
              <bitRange>[12:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFQPI</name>
              <description>Tx FIFO/Queue Put Index</description>
              <bitRange>[20:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TFQF</name>
              <description>Tx FIFO/Queue Full</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXESC</name>
          <addressOffset>0xC8</addressOffset>
          <fields>
            <field>
              <name>TBDS</name>
              <description>Tx Buffer Data Field Size</description>
              <bitRange>[2:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBRP</name>
          <addressOffset>0xCC</addressOffset>
          <fields>
            <field>
              <name>TRP0</name>
              <description>Transmission Request Pending</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP1</name>
              <description>Transmission Request Pending</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP2</name>
              <description>Transmission Request Pending</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP3</name>
              <description>Transmission Request Pending</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP4</name>
              <description>Transmission Request Pending</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP5</name>
              <description>Transmission Request Pending</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP6</name>
              <description>Transmission Request Pending</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP7</name>
              <description>Transmission Request Pending</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP8</name>
              <description>Transmission Request Pending</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP9</name>
              <description>Transmission Request Pending</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP10</name>
              <description>Transmission Request Pending</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP11</name>
              <description>Transmission Request Pending</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP12</name>
              <description>Transmission Request Pending</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP13</name>
              <description>Transmission Request Pending</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP14</name>
              <description>Transmission Request Pending</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP15</name>
              <description>Transmission Request Pending</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP16</name>
              <description>Transmission Request Pending</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP17</name>
              <description>Transmission Request Pending</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP18</name>
              <description>Transmission Request Pending</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP19</name>
              <description>Transmission Request Pending</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP20</name>
              <description>Transmission Request Pending</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP21</name>
              <description>Transmission Request Pending</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP22</name>
              <description>Transmission Request Pending</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP23</name>
              <description>Transmission Request Pending</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP24</name>
              <description>Transmission Request Pending</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP25</name>
              <description>Transmission Request Pending</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP26</name>
              <description>Transmission Request Pending</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP27</name>
              <description>Transmission Request Pending</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP28</name>
              <description>Transmission Request Pending</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP29</name>
              <description>Transmission Request Pending</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP30</name>
              <description>Transmission Request Pending</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRP31</name>
              <description>Transmission Request Pending</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
