breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x120</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLASH</name>
        <description>FLASH global Interrupt</description>
        <value>4</value>
      </interrupt>
      <registers>
        <register>
          <name>ACR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LATENCY</name>
              <description>Latency</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>PRFTEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ICEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DCEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>KEY</name>
              <description>Flash CR key</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTKEYR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>OPTKEY</name>
              <description>Flash Option key</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>EOP</name>
              <description>End of operation</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WRPERR</name>
              <description>Write protection error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RDERR</name>
              <description>bank0 read error</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OPTVERR</name>
              <description>Option and trimming bits loading validity error</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BSY0</name>
              <description>Bank0 Busy</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BSY1</name>
              <description>Bank1 Busy</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>USRLOCK0</name>
              <description>Userdata Lock</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>PG</name>
              <description>Page Program</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PER</name>
              <description>Page Erase</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MER</name>
              <description>Bank 0 Mass Erase</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UPG</name>
              <description>User data page Program</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UPER</name>
              <description>User data Page erase</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SER</name>
              <description>Sector Erase</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OPTSTRT</name>
              <description>Option bytes Programming Start</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>PGSTRT</name>
              <description>Programming Start</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>RDERRIE</name>
              <description>bank1 read error</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EOPIE</name>
              <description>End of operation interrupt enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>OBL_LAUNCH</name>
              <description>Force the option bytes loading</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>SECPROT0</name>
              <description>bank0 sec protect</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>SECPROT1</name>
              <description>bank1 sec protect</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>OPTLOCK</name>
              <description>Option Lock</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTR1</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>RDP</name>
              <description>Read Protection</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NRST_STDBY</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>NRST_STOP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>NRST_MODE</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IWDG_STDBY</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>IWDG_STOP</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>IWDG_SW</name>
              <description>IWDG Software Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>WWDG_SW</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>NBOOT0</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>NBOOT1</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>NSWBOOT0</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>BFB</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BOOT_LOCK</name>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTR2</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>ACC_CTRL</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>PLL_UNLOCK</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPR0</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>BANK0_WRPR</name>
              <description>Write Protection Disable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCROPR0</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>PCROP0SR</name>
              <bitRange>[8:0]</bitRange>
            </field>
            <field>
              <name>PCROP0ER</name>
              <bitRange>[24:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SECR0</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SEC_SIZEER0</name>
              <bitRange>[24:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPR1</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>BANK0_WRPR</name>
              <description>Write Protection Disable</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCROPR1</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>PCROP1SR</name>
              <bitRange>[8:0]</bitRange>
            </field>
            <field>
              <name>PCROP1ER</name>
              <bitRange>[24:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SECR1</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>SEC_SIZEER1</name>
              <bitRange>[24:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS0</name>
          <addressOffset>0x100</addressOffset>
          <fields>
            <field>
              <name>TS0</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS1</name>
          <addressOffset>0x104</addressOffset>
          <fields>
            <field>
              <name>TS1</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS2P</name>
          <addressOffset>0x108</addressOffset>
          <fields>
            <field>
              <name>TS2P</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPS3</name>
          <addressOffset>0x10C</addressOffset>
          <fields>
            <field>
              <name>TPS3</name>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS3</name>
          <addressOffset>0x110</addressOffset>
          <fields>
            <field>
              <name>TS3</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ERSTPE</name>
          <addressOffset>0x114</addressOffset>
          <fields>
            <field>
              <name>ERSTPE</name>
              <bitRange>[14:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRGTPE</name>
          <addressOffset>0x118</addressOffset>
          <fields>
            <field>
              <name>PRGTPE</name>
              <bitRange>[14:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRETPE</name>
          <addressOffset>0x11C</addressOffset>
          <fields>
            <field>
              <name>PRETPE</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
