breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GPIOD</name>
      <baseAddress>0x40024C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MODER</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MODER0</name>
              <description>GPIOD0 MODE</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MODER1</name>
              <description>GPIOD1 MODE</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MODER2</name>
              <description>GPIOD2 MODE</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MODER3</name>
              <description>GPIOD3 MODE</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MODER4</name>
              <description>GPIOD4 MODE</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MODER5</name>
              <description>GPIOD5 MODE</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MODER6</name>
              <description>GPIOD6 MODE</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MODER7</name>
              <description>GPIOD7 MODE</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MODER8</name>
              <description>GPIOD8 MODE</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MODER9</name>
              <description>GPIOD9 MODE</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MODER10</name>
              <description>GPIOD10 MODE</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MODER11</name>
              <description>GPIOD11 MODE</description>
              <bitRange>[23:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OTYPER</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>OT0</name>
              <description>GPIOD0 Output type</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OT1</name>
              <description>GPIOD1 Output type</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OT2</name>
              <description>GPIOD2 Output type</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OT3</name>
              <description>GPIOD3 Output type</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OT4</name>
              <description>GPIOD4 Output type</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OT5</name>
              <description>GPIOD5 Output type</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OT6</name>
              <description>GPIOD6 Output type</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OT7</name>
              <description>GPIOD7 Output type</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OT8</name>
              <description>GPIOD8 Output type</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OT9</name>
              <description>GPIOD9 Output type</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OT10</name>
              <description>GPIOD10 Output type</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OT11</name>
              <description>GPIOD11 Output type</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OSPDDER</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>OSPEED0</name>
              <description>GPIOD0 output speed</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OSPEED1</name>
              <description>GPIOD1 output speed</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>OSPEED2</name>
              <description>GPIOD2 output speed</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>OSPEED3</name>
              <description>GPIOD3 output speed</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>OSPEED4</name>
              <description>GPIOD4 output speed</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OSPEED5</name>
              <description>GPIOD5 output speed</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>OSPEED6</name>
              <description>GPIOD6 output speed</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>OSPEED7</name>
              <description>GPIOD7 output speed</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>OSPEED8</name>
              <description>GPIOD8 output speed</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>OSPEED9</name>
              <description>GPIOD9 output speed</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>OSPEED10</name>
              <description>GPIOD10 output speed</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>OSPEED11</name>
              <description>GPIOD11 output speed</description>
              <bitRange>[23:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PUPDR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PUPD0</name>
              <description>GPIOD0 pull up/pull down</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PUPD1</name>
              <description>GPIOD1 pull up/pull down</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>PUPD2</name>
              <description>GPIOD2 pull up/pull down</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>PUPD3</name>
              <description>GPIOD3 pull up/pull down</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>PUPD4</name>
              <description>GPIOD4 pull up/pull down</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>PUPD5</name>
              <description>GPIOD5 pull up/pull down</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PUPD6</name>
              <description>GPIOD6 pull up/pull down</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>PUPD7</name>
              <description>GPIOD7 pull up/pull down</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PUPD8</name>
              <description>GPIOD8 pull up/pull down</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>PUPD9</name>
              <description>GPIOD9 pull up/pull down</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>PUPD10</name>
              <description>GPIOD10 pull up/pull down</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>PUPD11</name>
              <description>GPIOD11 pull up/pull down</description>
              <bitRange>[23:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>ID0</name>
              <description>GPIOD0 input data</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID1</name>
              <description>GPIOD1 input data</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID2</name>
              <description>GPIOD2 input data</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID3</name>
              <description>GPIOD3 input data</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID4</name>
              <description>GPIOD4 input data</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID5</name>
              <description>GPIOD5 input data</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID6</name>
              <description>GPIOD6 input data</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID7</name>
              <description>GPIOD7 input data</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID8</name>
              <description>GPIOD8 input data</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID9</name>
              <description>GPIOD9 input data</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID10</name>
              <description>GPIOD10 input data</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ID11</name>
              <description>GPIOD11 input data</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ODR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>OD0</name>
              <description>GPIOD0 output data</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OD1</name>
              <description>GPIOD1 output data</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OD2</name>
              <description>GPIOD2 output data</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OD3</name>
              <description>GPIOD3 output data</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OD4</name>
              <description>GPIOD4 output data</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OD5</name>
              <description>GPIOD5 output data</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OD6</name>
              <description>GPIOD6 output data</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OD7</name>
              <description>GPIOD7 output data</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OD8</name>
              <description>GPIOD8 output data</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OD9</name>
              <description>GPIOD9 output data</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OD10</name>
              <description>GPIOD10 output data</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OD11</name>
              <description>GPIOD11 output data</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BSRR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>BS0</name>
              <description>GPIOD0 output set</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BS1</name>
              <description>GPIOD1 output set</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BS2</name>
              <description>GPIOD2 output set</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BS3</name>
              <description>GPIOD3 output set</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BS4</name>
              <description>GPIOD4 output set</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BS5</name>
              <description>GPIOD5 output set</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BS6</name>
              <description>GPIOD6 output set</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BS7</name>
              <description>GPIOD7 output set</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BS8</name>
              <description>GPIOD8 output set</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BS9</name>
              <description>GPIOD9 output set</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BS10</name>
              <description>GPIOD10 output set</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BS11</name>
              <description>GPIOD11 output set</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BR0</name>
              <description>GPIOD0 outut reset</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BR1</name>
              <description>GPIOD1 outut reset</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>BR2</name>
              <description>GPIOD2 outut reset</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>BR3</name>
              <description>GPIOD3 outut reset</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BR4</name>
              <description>GPIOD4 outut reset</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BR5</name>
              <description>GPIOD5 outut reset</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BR6</name>
              <description>GPIOD6 outut reset</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>BR7</name>
              <description>GPIOD7 outut reset</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>BR8</name>
              <description>GPIOD8 outut reset</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>BR9</name>
              <description>GPIOD9 outut reset</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>BR10</name>
              <description>GPIOD10 outut reset</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>BR11</name>
              <description>GPIOD11 outut reset</description>
              <bitRange>[27:27]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKR</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>LCK0</name>
              <description>GPIOD lock(bit0)</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LCK1</name>
              <description>GPIOD lock(bit1)</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LCK2</name>
              <description>GPIOD lock(bit2)</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LCK3</name>
              <description>GPIOD lock(bit3)</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LCK4</name>
              <description>GPIOD lock(bit4)</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LCK5</name>
              <description>GPIOD lock(bit5)</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LCK6</name>
              <description>GPIOD lock(bit6)</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LCK7</name>
              <description>GPIOD lock(bit7)</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LCK8</name>
              <description>GPIOD lock(bit8)</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LCK9</name>
              <description>GPIOD lock(bit9)</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LCK10</name>
              <description>GPIOD lock(bit10)</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LCK11</name>
              <description>GPIOD lock(bit11)</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LCKK</name>
              <description>GPIOD lock key</description>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRL</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>AFSEL0</name>
              <description>GPIOD0 AF select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>AFSEL1</name>
              <description>GPIOD1 AF select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>AFSEL2</name>
              <description>GPIOD2 AF select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>AFSEL3</name>
              <description>GPIOD3 AF select</description>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>AFSEL4</name>
              <description>GPIOD4 AF select</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>AFSEL5</name>
              <description>GPIOD5 AF select</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>AFSEL6</name>
              <description>GPIOD6 AF select</description>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>AFSEL7</name>
              <description>GPIOD7 AF select</description>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AFRH</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>AFSEL8</name>
              <description>GPIOD8 AF select</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>AFSEL9</name>
              <description>GPIOD9 AF select</description>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>AFSEL10</name>
              <description>GPIOD10 AF select</description>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>AFSEL11</name>
              <description>GPIOD11 AF select</description>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
