breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
        <register>
          <name>BRR</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>BR0</name>
              <description>GPIOD 0 output pin reset</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BR1</name>
              <description>GPIOD 1 output pin reset</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BR2</name>
              <description>GPIOD 2 output pin reset</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BR3</name>
              <description>GPIOD 3 output pin reset</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BR4</name>
              <description>GPIOD 4 output pin reset</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BR5</name>
              <description>GPIOD 5 output pin reset</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>BR6</name>
              <description>GPIOD 6 output pin reset</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BR7</name>
              <description>GPIOD 7 output pin reset</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>BR8</name>
              <description>GPIOD 8 output pin reset</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>BR9</name>
              <description>GPIOD 9 output pin reset</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BR10</name>
              <description>GPIOD 10 output pin reset</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BR11</name>
              <description>GPIOD 11 output pin reset</description>
              <bitRange>[11:11]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>HRPWM1</name>
      <groupName>HRPWM</groupName>
      <baseAddress>0x40018000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>HRPWM1</name>
        <description>HRPWM1 global Interrupt</description>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>HRPWM1_TZ</name>
        <description>HRPWM1 Trip Interrupt</description>
        <value>57</value>
      </interrupt>
      <registers>
        <register>
          <name>TBCTL</name>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CTRMODE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PHSEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PRDLD</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SYNCOSEL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>SWFSYNC</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>HSPCLKDIV</name>
              <bitRange>[9:7]</bitRange>
            </field>
            <field>
              <name>CLKDIV</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>PHSDIR</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>FREE_SOFT</name>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBCTL2</name>
          <addressOffset>0x2</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>OSHTSYNCMODE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>OSHTSYNC</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SYNCOSELX</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>PRDLDSYNC</name>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBCTR</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TBCTR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBSTS</name>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CTRDIR</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCI</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CTRMAX</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCTL</name>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>LOADAMODE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>LOADBMODE</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>SHDWAMODE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SHDWBMODE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SHDWAFULL</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SHDWBFULL</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LOADASYNC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>LOADBSYNC</name>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPCTL2</name>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>LOADCMODE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>LOADDMODE</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>SHDWCMODE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SHDWDMODE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LOADCSYNC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>LOADDSYNC</name>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBCTL</name>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>OUT_MODE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>POLSEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IN_MODE</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>LOADREDMODE</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>LOADFEDMODE</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SHDWDBRED_MODE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SHDWDBFED_MODE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OUTSWAP</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>DEDB_MODE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>HALFCYCLE</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBCTL2</name>
          <addressOffset>0x1A</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>LOADDBCTLMODE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SHDWDBCTLMODE</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AQCTL</name>
          <addressOffset>0x20</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>LDAQAMODE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>LDAQBMODE</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>SHDWAQAMODE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SHDWAQBMODE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LDAQASYNC</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>LDAQBSYNC</name>
              <bitRange>[11:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AQTSRCSEL</name>
          <addressOffset>0x22</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>T1SEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>T2SEL</name>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCCTL</name>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CHPEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OSHTWTH</name>
              <bitRange>[4:1]</bitRange>
            </field>
            <field>
              <name>CHPFREQ</name>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>CHPDUTY</name>
              <bitRange>[10:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VCAPCTL</name>
          <addressOffset>0x30</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>VCAPE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VCAPSTART</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRIGSEL</name>
              <bitRange>[4:2]</bitRange>
            </field>
            <field>
              <name>VDELAYDIV</name>
              <bitRange>[9:7]</bitRange>
            </field>
            <field>
              <name>EDGEFILTDLYSEL</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>VCNTCFG</name>
          <addressOffset>0x32</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>STARTEDGE</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>STARTEDGESTS</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STOPEDGE</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>STOPEDGESTS</name>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HRCNFG</name>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EDGMODE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTLMODE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HRLOAD</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>SELOUTB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>AUTOCONV</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SWAPAB</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>EDGMODEB</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CTLMODEB</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>HRLOADB</name>
              <bitRange>[12:11]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HRPWR</name>
          <addressOffset>0x42</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CALPWRON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HRMSTEP</name>
          <addressOffset>0x4C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>HRMSTEP</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HRCNFG2</name>
          <addressOffset>0x4E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EDGMODEDB</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CTLMODEDBRED</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>CTLMODEDBFED</name>
              <bitRange>[5:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HRPCTL</name>
          <addressOffset>0x5A</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>HRPE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PWMSYNCSEL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TBPHSHRLOADE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>PWMSYNCSELX</name>
              <bitRange>[6:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRREM</name>
          <addressOffset>0x5C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TREEM</name>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GLDCTL</name>
          <addressOffset>0x68</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>GLD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GLDMODE</name>
              <bitRange>[4:1]</bitRange>
            </field>
            <field>
              <name>OSHTMODE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>GLDPRD</name>
              <bitRange>[9:7]</bitRange>
            </field>
            <field>
              <name>GLDCNT</name>
              <bitRange>[12:10]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GLDCFG</name>
          <addressOffset>0x6A</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TBPRD_TBPRDRHR</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CMPA_CMPAHR</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CMPB_CMPBHR</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CMPC</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CMPD</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DBRED_DBREDHR</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DBFED_DBFEDHR</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DBCTL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>AQCTLA_AQCTLA2</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>AQCTLB_AQCTLB2</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AQCSPRC</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMXLINK</name>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>TBPRDLINK</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CMPALINK</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>CMPBLINK</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>CMPCLINK</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>CMPDLINK</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>GLDCTL2LINK</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AQCTLA</name>
          <addressOffset>0x80</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ZRO</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PRD</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>CAU</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>CAD</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>CBU</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CBD</name>
              <bitRange>[11:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AQCTLA2</name>
          <addressOffset>0x82</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>T1U</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1D</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>T2U</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>T2D</name>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AQCTLB</name>
          <addressOffset>0x84</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ZRO</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PRD</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>CAU</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>CAD</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>CBU</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>CBD</name>
              <bitRange>[11:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AQCTLB2</name>
          <addressOffset>0x86</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>T1U</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>T1D</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>T2U</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>T2D</name>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AQSFRC</name>
          <addressOffset>0x8E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ACTSFA</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OTSFA</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ACTSFB</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>OTSFB</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RLDCSF</name>
              <bitRange>[7:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AQCSPFRC</name>
          <addressOffset>0x92</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CSFA</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>CSFB</name>
              <bitRange>[3:2]</bitRange>
            </field>
          </fields>
        </register>
