breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
        <register>
          <name>DBREDHR</name>
          <addressOffset>0xA0</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DBREDHR</name>
              <bitRange>[15:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBRED</name>
          <addressOffset>0xA2</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DBRED</name>
              <bitRange>[13:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBFEDHR</name>
          <addressOffset>0xA4</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DBFEDHR</name>
              <bitRange>[15:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DBFED</name>
          <addressOffset>0xA6</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DBFED</name>
              <bitRange>[13:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPHS</name>
          <addressOffset>0xC0</addressOffset>
          <fields>
            <field>
              <name>TBPHSHR</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>TBPHS</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPRDHR</name>
          <addressOffset>0xC4</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TBPRDHR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TBPRD</name>
          <addressOffset>0xC6</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TBPRD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPA</name>
          <addressOffset>0xD4</addressOffset>
          <fields>
            <field>
              <name>CMPAHR</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CMPA</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPB</name>
          <addressOffset>0xD8</addressOffset>
          <fields>
            <field>
              <name>CMPBHR</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>CMPB</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPC</name>
          <addressOffset>0xDE</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CMPC</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMPD</name>
          <addressOffset>0xE2</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CMPD</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GLDCTL2</name>
          <addressOffset>0xE8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>OSHTLD</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GFRCLD</name>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SWVDELVAL</name>
          <addressOffset>0xEE</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SWVDELVAL</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TZSEL</name>
          <addressOffset>0x100</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CBC1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CBC2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CBC3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CBC4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CBC5</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CBC6</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DCAEVT2</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DCBEVT2</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OSHT1</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OSHT2</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OSHT3</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OSHT4</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OSHT5</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>OSHT6</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DCAEVT1</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DCBEVT1</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TZDCSEL</name>
          <addressOffset>0x104</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DCAEVT1</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>DCAEVT2</name>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>DCBEVT1</name>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>DCBEVT2</name>
              <bitRange>[11:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TZCTL</name>
          <addressOffset>0x108</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TZA</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>TZB</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>DCAEVT1</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>DCAEVT2</name>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>DCBEVT1</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>DCBEVT2</name>
              <bitRange>[11:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TZCTL2</name>
          <addressOffset>0x10A</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TZAU</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>TZAD</name>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>TZBU</name>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>TZBD</name>
              <bitRange>[11:9]</bitRange>
            </field>
            <field>
              <name>ETZE</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TZCTLDCA</name>
          <addressOffset>0x10C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DCAEVT1U</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>DCAEVT1D</name>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>DCAEVT2U</name>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>DCAEVT2D</name>
              <bitRange>[11:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TZCTLDCB</name>
          <addressOffset>0x10E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DCBEVT1U</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>DCBEVT1D</name>
              <bitRange>[5:3]</bitRange>
            </field>
            <field>
              <name>DCBEVT2U</name>
              <bitRange>[8:6]</bitRange>
            </field>
            <field>
              <name>DCBEVT2D</name>
              <bitRange>[11:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TZEINT</name>
          <addressOffset>0x11A</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CBC</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OST</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DCAEVT1</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DCAEVT2</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DCBEVT1</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DCBEVT2</name>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TZFLG</name>
          <addressOffset>0x126</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>INT</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CBC</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OST</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DCAEVT1</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DCAEVT2</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DCBEVT1</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DCBEVT2</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZCBCFLG</name>
          <addressOffset>0x128</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CBC1</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CBC2</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CBC3</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CBC4</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CBC5</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CBC6</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DCAEVT2</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DCBEVT2</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZOSTFLG</name>
          <addressOffset>0x12A</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>OST1</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OST2</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OST3</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OST4</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OST5</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OST6</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DCAEVT1</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DCBEVT1</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TZCLR</name>
          <addressOffset>0x12E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>INT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CBC</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OST</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DCAEVT1</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DCAEVT2</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DCBEVT1</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DCBEVT2</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CBCPULSE</name>
              <bitRange>[15:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TZCBCCLR</name>
          <addressOffset>0x130</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CBC1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CBC2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CBC3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CBC4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CBC5</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CBC6</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DCAEVT2</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DCBEVT2</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TZOSTCLR</name>
          <addressOffset>0x132</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>OST1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OST2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OST3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OST4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OST5</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>OST6</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DCAEVT1</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DCBEVT1</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TZFRC</name>
          <addressOffset>0x136</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CBC</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OST</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>DCAEVT1</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DCAEVT2</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DCBEVT1</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DCBEVT2</name>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETSEL</name>
          <addressOffset>0x148</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>INTSEL</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>INTEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SOCASELCMP</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SOCBSELCMP</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>INTSELCMP</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SOCASEL</name>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>SOCAEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SOCBSEL</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>SOCBEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETPS</name>
          <addressOffset>0x14C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>INTPRD</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>INTCNT</name>
              <bitRange>[3:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INTPSSEL</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SOCPSSEL</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SOCAPRD</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>SOCACNT</name>
              <bitRange>[11:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SOCBPRD</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>SOCBCNT</name>
              <bitRange>[15:14]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETFLG</name>
          <addressOffset>0x150</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>INT</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SOCA</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SOCB</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETCLR</name>
          <addressOffset>0x154</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>INT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOCA</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOCB</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETFRC</name>
          <addressOffset>0x158</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>INT</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOCA</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOCB</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETINTPS</name>
          <addressOffset>0x15C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>INTPRD2</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>INTCNT2</name>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
