breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
        <register>
          <name>ETSOCPS</name>
          <addressOffset>0x160</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SOCAPRD2</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>SOCACNT2</name>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SOCBPRD2</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>SOCBCNT2</name>
              <bitRange>[15:12]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETCNTINITCTL</name>
          <addressOffset>0x164</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>INTINITFRC</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SOCAINITFRC</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SOCBINITFRC</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>INTINTEN</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SOCAINTEN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SOCBINTEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ETCNTINIT</name>
          <addressOffset>0x168</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>INTINT</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>SOCAINT</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>SOCBINT</name>
              <bitRange>[11:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCTRIPSEL</name>
          <addressOffset>0x180</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DCAHCOMPSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DCALCOMPSEL</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>DCBHCOMPSEL</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>DCBLCOMPSEL</name>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCACTL</name>
          <addressOffset>0x186</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EVT1SRCSEL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EVT1FRCSYNCSEL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EVT1SOCE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EVT1SYNCE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EVT2SRCSEL</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EVT2FRCSYNCSEL</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCBCTL</name>
          <addressOffset>0x188</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EVT1SRCSEL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EVT1FRCSYNCSEL</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>EVT1SOCE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>EVT1SYNCE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>EVT2SRCSEL</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>EVT2FRCSYNCSEL</name>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFCTL</name>
          <addressOffset>0x18E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SRCSEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>BLANKE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BLANKINV</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PULSESEL</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EDGEFILTSEL</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>EDGEMODE</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EDGECOUNT</name>
              <bitRange>[12:10]</bitRange>
            </field>
            <field>
              <name>EDGESTATUS</name>
              <bitRange>[15:13]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCAPCTL</name>
          <addressOffset>0x190</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>CAPE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SHDWMODE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CAPSTS</name>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CAPCLR</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CAPMODE</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFOFFSET</name>
          <addressOffset>0x192</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DCFOFFSET</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFOFFSETCNT</name>
          <addressOffset>0x194</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DCFOFFSETCNT</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFWINDOW</name>
          <addressOffset>0x196</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DCFWINDOW</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCFWINDOWCNT</name>
          <addressOffset>0x198</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DCFWINDOWCNT</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCAP</name>
          <addressOffset>0x19E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DCCAP</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCAHTRIPSEL</name>
          <addressOffset>0x1A4</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TRIPINPUT1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT5</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT6</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT7</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT8</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT9</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT10</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT11</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT12</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT14</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT15</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCALTRIPSEL</name>
          <addressOffset>0x1A6</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TRIPINPUT1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT5</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT6</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT7</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT8</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT9</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT10</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT11</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT12</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT14</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT15</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCBHTRIPSEL</name>
          <addressOffset>0x1A8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TRIPINPUT1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT5</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT6</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT7</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT8</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT9</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT10</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT11</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT12</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT14</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT15</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCBLTRIPSEL</name>
          <addressOffset>0x1AA</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TRIPINPUT1</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT2</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT3</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT4</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT5</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT6</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT7</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT8</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT9</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT10</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT11</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT12</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT14</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TRIPINPUT15</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWMLOCK</name>
          <addressOffset>0x1F4</addressOffset>
          <fields>
            <field>
              <name>HRLOCK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GLLOCK</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TZCFGLOCK</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TZCLRLOCK</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DCLOCK</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>KEY</name>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HWVDELVAL</name>
          <addressOffset>0x1FA</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>HWVDELVAL</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VCNTVAL</name>
          <addressOffset>0x1FC</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>VCNTVAL</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
