breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="HRPWM1">
      <name>HRPWM2</name>
      <baseAddress>0x40018400</baseAddress>
      <interrupt>
        <name>HRPWM2</name>
        <description>HRPWM2 global Interrupt</description>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>HRPWM2_TZ</name>
        <description>HRPWM2 Trip Interrupt</description>
        <value>58</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="HRPWM1">
      <name>HRPWM3</name>
      <baseAddress>0x40018800</baseAddress>
      <interrupt>
        <name>HRPWM3</name>
        <description>HRPWM3 global Interrupt</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>HRPWM3_TZ</name>
        <description>HRPWM3 Trip Interrupt</description>
        <value>59</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="HRPWM1">
      <name>HRPWM4</name>
      <baseAddress>0x40018C00</baseAddress>
      <interrupt>
        <name>HRPWM4</name>
        <description>HRPWM4 global Interrupt</description>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>HRPWM4_TZ</name>
        <description>HRPWM4 Trip Interrupt</description>
        <value>60</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="HRPWM1">
      <name>HRPWM5</name>
      <baseAddress>0x40019000</baseAddress>
      <interrupt>
        <name>HRPWM5</name>
        <description>HRPWM5 global Interrupt</description>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>HRPWM5_TZ</name>
        <description>HRPWM5 Trip Interrupt</description>
        <value>61</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="HRPWM1">
      <name>HRPWM6</name>
      <baseAddress>0x40019400</baseAddress>
      <interrupt>
        <name>HRPWM6</name>
        <description>HRPWM6 global Interrupt</description>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>HRPWM6_TZ</name>
        <description>HRPWM6 Trip Interrupt</description>
        <value>62</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>HRPWMC</name>
      <baseAddress>0x40019800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IXBSEL1_2</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SEL1</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SEL2</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[21:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IXBSEL3_4</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SEL3</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SEL4</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[21:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IXBSEL5_6</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SEL5</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SEL6</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[21:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IXBSEL7_8</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>SEL7</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SEL8</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[21:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IXBSEL9_10</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>SEL9</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SEL10</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[21:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IXBSEL11_12</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>SEL11</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SEL12</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[21:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IXBSEL13_14</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>SEL13</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>SEL14</name>
              <description>eallow, inputxbar_lock</description>
              <bitRange>[21:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IXBAQSEL</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>AQSEL1</name>
              <description>eallow</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>AQSEL2</name>
              <description>eallow</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>AQSEL3</name>
              <description>eallow, lock_fl</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>AQSEL4</name>
              <description>eallow, lock_fl</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>AQSEL5</name>
              <description>eallow, lock_fl</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>AQSEL6</name>
              <description>eallow, lock_fl</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>AQSEL7</name>
              <description>eallow, lock_fl</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>AQSEL8</name>
              <description>eallow, lock_fl</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>AQSEL9</name>
              <description>eallow, lock_fl</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>AQSEL10</name>
              <description>eallow, lock_fl</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>AQSEL11</name>
              <description>eallow, lock_fl</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>AQSEL12</name>
              <description>eallow, lock_fl</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>AQSEL13</name>
              <description>eallow, lock_fl</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>AQSEL14</name>
              <description>eallow, lock_fl</description>
              <bitRange>[27:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IXBSEL_LOCK</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>LOCK1</name>
              <description>eallow</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LOCK2</name>
              <description>eallow</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>LOCK3</name>
              <description>eallow</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LOCK4</name>
              <description>eallow</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>LOCK5</name>
              <description>eallow</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LOCK6</name>
              <description>eallow</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LOCK7</name>
              <description>eallow</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LOCK8</name>
              <description>eallow</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>LOCK9</name>
              <description>eallow</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>LOCK10</name>
              <description>eallow</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>LOCK11</name>
              <description>eallow</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>LOCK12</name>
              <description>eallow</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LOCK13</name>
              <description>eallow</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>LOCK14</name>
              <description>eallow</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>LOCK_FL</name>
              <description>eallow</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IXBCTRL</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>ISAPRD0</name>
              <description>eallow, lock_fl</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>ISAPRD1</name>
              <description>eallow, lock_fl</description>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB4_0</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>MUX0</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX1</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX2</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX3</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX4</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX5</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX6</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX7</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX8</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX9</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX10</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX11</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX12</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX13</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX14</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX15</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB4_1</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>MUX16</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX17</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX18</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX19</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX20</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX21</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX22</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX23</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX24</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX25</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX26</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX27</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX28</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX29</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX30</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX31</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB5_0</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>MUX0</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX1</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX2</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX3</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX4</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX5</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX6</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX7</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX8</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX9</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX10</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX11</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX12</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX13</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX14</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX15</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB5_1</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>MUX16</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX17</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX18</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX19</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX20</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX21</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX22</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX23</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX24</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX25</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX26</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX27</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX28</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX29</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX30</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX31</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
