breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
        <register>
          <name>HXB7_0</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>MUX0</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX1</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX2</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX3</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX4</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX5</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX6</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX7</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX8</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX9</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX10</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX11</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX12</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX13</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX14</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX15</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB7_1</name>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>MUX16</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX17</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX18</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX19</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX20</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX21</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX22</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX23</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX24</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX25</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX26</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX27</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX28</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX29</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX30</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX31</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB8_0</name>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>MUX0</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX1</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX2</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX3</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX4</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX5</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX6</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX7</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX8</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX9</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX10</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX11</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX12</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX13</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX14</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX15</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB8_1</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>MUX16</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX17</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX18</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX19</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX20</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX21</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX22</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX23</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX24</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX25</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX26</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX27</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX28</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX29</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX30</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX31</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB9_0</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>MUX0</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX1</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX2</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX3</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX4</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX5</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX6</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX7</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX8</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX9</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX10</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX11</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX12</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX13</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX14</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX15</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB9_1</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>MUX16</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX17</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX18</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX19</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX20</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX21</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX22</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX23</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX24</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX25</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX26</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX27</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX28</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX29</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX30</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX31</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB10_0</name>
          <addressOffset>0x68</addressOffset>
          <fields>
            <field>
              <name>MUX0</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX1</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX2</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX3</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX4</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX5</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX6</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX7</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX8</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX9</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX10</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX11</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX12</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX13</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX14</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX15</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
