breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
        <register>
          <name>HXB10_1</name>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>MUX16</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX17</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX18</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX19</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX20</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX21</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX22</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX23</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX24</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX25</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX26</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX27</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX28</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX29</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX30</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX31</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB11_0</name>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>MUX0</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX1</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX2</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX3</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX4</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX5</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX6</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX7</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX8</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX9</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX10</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX11</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX12</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX13</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX14</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX15</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB11_1</name>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>MUX16</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX17</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX18</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX19</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX20</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX21</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX22</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX23</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX24</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX25</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX26</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX27</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX28</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX29</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX30</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX31</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB12_0</name>
          <addressOffset>0x78</addressOffset>
          <fields>
            <field>
              <name>MUX0</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX1</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX2</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX3</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX4</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX5</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX6</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX7</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX8</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX9</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX10</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX11</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX12</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX13</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX14</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX15</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB12_1</name>
          <addressOffset>0x7C</addressOffset>
          <fields>
            <field>
              <name>MUX16</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>MUX17</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>MUX18</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MUX19</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>MUX20</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MUX21</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>MUX22</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MUX23</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>MUX24</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>MUX25</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[19:18]</bitRange>
            </field>
            <field>
              <name>MUX26</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>MUX27</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>MUX28</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>MUX29</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>MUX30</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>MUX31</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB4_MUX</name>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>MUXEN</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB5_MUX</name>
          <addressOffset>0x84</addressOffset>
          <fields>
            <field>
              <name>MUXEN</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB7_MUX</name>
          <addressOffset>0x88</addressOffset>
          <fields>
            <field>
              <name>MUXEN</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB8_MUX</name>
          <addressOffset>0x8C</addressOffset>
          <fields>
            <field>
              <name>MUXEN</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB9_MUX</name>
          <addressOffset>0x90</addressOffset>
          <fields>
            <field>
              <name>MUXEN</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB10_MUX</name>
          <addressOffset>0x94</addressOffset>
          <fields>
            <field>
              <name>MUXEN</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB11_MUX</name>
          <addressOffset>0x98</addressOffset>
          <fields>
            <field>
              <name>MUXEN</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB12_MUX</name>
          <addressOffset>0x9C</addressOffset>
          <fields>
            <field>
              <name>MUXEN</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB_POL</name>
          <addressOffset>0xA0</addressOffset>
          <fields>
            <field>
              <name>HXB4P</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HXB5P</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HXB7P</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HXB8P</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HXB9P</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HXB10P</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>HXB11P</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>HXB12P</name>
              <description>eallow, HRPWMXBAR_LOCK</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HXB_LOCK</name>
          <addressOffset>0xA4</addressOffset>
          <fields>
            <field>
              <name>LOCK</name>
              <description>eallow</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>KEY</name>
              <description>eallow</description>
              <bitRange>[31:16]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCI_SEL1_4</name>
          <addressOffset>0xC0</addressOffset>
          <fields>
            <field>
              <name>SEL1</name>
              <description>eallow, SYNCSELECT_LOCK</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>SEL2</name>
              <description>eallow, SYNCSELECT_LOCK</description>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>SEL3</name>
              <description>eallow, SYNCSELECT_LOCK</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>SEL4</name>
              <description>eallow, SYNCSELECT_LOCK</description>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCI_SEL5_6</name>
          <addressOffset>0xC4</addressOffset>
          <fields>
            <field>
              <name>SEL5</name>
              <description>eallow, SYNCSELECT_LOCK</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>SEL6</name>
              <description>eallow, SYNCSELECT_LOCK</description>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCO_SEL1_4</name>
          <addressOffset>0xC8</addressOffset>
          <fields>
            <field>
              <name>SEL1</name>
              <description>eallow</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>SEL2</name>
              <description>eallow</description>
              <bitRange>[12:8]</bitRange>
            </field>
            <field>
              <name>SEL3</name>
              <description>eallow</description>
              <bitRange>[20:16]</bitRange>
            </field>
            <field>
              <name>SEL4</name>
              <description>eallow</description>
              <bitRange>[28:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCO_SEL5_6</name>
          <addressOffset>0xCC</addressOffset>
          <fields>
            <field>
              <name>SEL5</name>
              <description>eallow</description>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>SEL6</name>
              <description>eallow</description>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
