breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
        <register>
          <name>ADCOUT</name>
          <addressOffset>0xD0</addressOffset>
          <fields>
            <field>
              <name>SOC1A_EN</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SOC2A_EN</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SOC3A_EN</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOC4A_EN</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>SOC5A_EN</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SOC6A_EN</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SOC1B_EN</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>SOC2B_EN</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>SOC3B_EN</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>SOC4B_EN</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>SOC5B_EN</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>SOC6B_EN</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>SOCA_POL</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SOCB_POL</name>
              <description>eallow , ADCSOCOUTSELECT_LOCK</description>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCOUT_CFG</name>
          <addressOffset>0xD4</addressOffset>
          <fields>
            <field>
              <name>SCOUT_SEL</name>
              <description>eallow</description>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>SCOUT_EXP_BYPASS</name>
              <description>eallow</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCSOCLOCK</name>
          <addressOffset>0xD8</addressOffset>
          <fields>
            <field>
              <name>SYNC</name>
              <description>eallow</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADCSOC</name>
              <description>eallow</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EALLOW</name>
          <addressOffset>0xDC</addressOffset>
          <fields>
            <field>
              <name>EALLOW</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EALLOW_KEY</name>
              <bitRange>[31:16]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKEN</name>
          <addressOffset>0xE0</addressOffset>
          <fields>
            <field>
              <name>HRPWM1_CLK_EN</name>
              <description>eallow</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HRPWM2_CLK_EN</name>
              <description>eallow</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>HRPWM3_CLK_EN</name>
              <description>eallow</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HRPWM4_CLK_EN</name>
              <description>eallow</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>HRPWM5_CLK_EN</name>
              <description>eallow</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>HRPWM6_CLK_EN</name>
              <description>eallow</description>
              <bitRange>[5:5]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XBARFLG1</name>
          <addressOffset>0xF0</addressOffset>
          <fields>
            <field>
              <name>COMP1_OUT_FLG</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP2_OUT_FLG</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP3_OUT_FLG</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>COMP4_OUT_FLG</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT1_FLG</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT2_FLG</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT3_FLG</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT4_FLG</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT5_FLG</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT6_FLG</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADCSOCA_FLG</name>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADCSOCB_FLG</name>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT7_FLG</name>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT8_FLG</name>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT9_FLG</name>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT10_FLG</name>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT11_FLG</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT12_FLG</name>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT13_FLG</name>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUT14_FLG</name>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1_AWD1_FLG</name>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1_AWD2_FLG</name>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC1_AWD3_FLG</name>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC2_AWD1_FLG</name>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC2_AWD2_FLG</name>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC2_AWD3_FLG</name>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM1_OC1_FLG</name>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM1_OC2_FLG</name>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM1_OC3_FLG</name>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM1_OC4_FLG</name>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM1_OC5_FLG</name>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM1_OC6_FLG</name>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBARFLG2</name>
          <addressOffset>0xF4</addressOffset>
          <fields>
            <field>
              <name>TIM2_OC1_FLG</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM2_OC2_FLG</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM2_OC3_FLG</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM2_OC4_FLG</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM3_OC1_FLG</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM3_OC2_FLG</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM3_OC3_FLG</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM3_OC4_FLG</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM8_OC1_FLG</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM8_OC2_FLG</name>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM8_OC3_FLG</name>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM8_OC4_FLG</name>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM8_OC5_FLG</name>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIM8_OC6_FLG</name>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HRPWM_SCOUT_FLG</name>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CPUHALT_FLG</name>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBARCLR1</name>
          <addressOffset>0xF8</addressOffset>
          <fields>
            <field>
              <name>COMP1_OUT_CLR</name>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>COMP2_OUT_CLR</name>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>COMP3_OUT_CLR</name>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>COMP4_OUT_CLR</name>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT1_CLR</name>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT2_CLR</name>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT3_CLR</name>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT4_CLR</name>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT5_CLR</name>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT6_CLR</name>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADCSOCA_CLR</name>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADCSOCB_CLR</name>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT7_CLR</name>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT8_CLR</name>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT9_CLR</name>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT10_CLR</name>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT11_CLR</name>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT12_CLR</name>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT13_CLR</name>
              <bitRange>[18:18]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>INPUT14_CLR</name>
              <bitRange>[19:19]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC1_AWD1_CLR</name>
              <bitRange>[20:20]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC1_AWD2_CLR</name>
              <bitRange>[21:21]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC1_AWD3_CLR</name>
              <bitRange>[22:22]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC2_AWD1_CLR</name>
              <bitRange>[23:23]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC2_AWD2_CLR</name>
              <bitRange>[24:24]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADC2_AWD3_CLR</name>
              <bitRange>[25:25]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM1_OC1_CLR</name>
              <bitRange>[26:26]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM1_OC2_CLR</name>
              <bitRange>[27:27]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM1_OC3_CLR</name>
              <bitRange>[28:28]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM1_OC4_CLR</name>
              <bitRange>[29:29]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM1_OC5_CLR</name>
              <bitRange>[30:30]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM1_OC6_CLR</name>
              <bitRange>[31:31]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>XBARCLR2</name>
          <addressOffset>0xFC</addressOffset>
          <fields>
            <field>
              <name>TIM2_OC1_CLR</name>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM2_OC2_CLR</name>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM2_OC3_CLR</name>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM2_OC4_CLR</name>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM3_OC1_CLR</name>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM3_OC2_CLR</name>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM3_OC3_CLR</name>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM3_OC4_CLR</name>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM8_OC1_CLR</name>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM8_OC2_CLR</name>
              <bitRange>[9:9]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM8_OC3_CLR</name>
              <bitRange>[10:10]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM8_OC4_CLR</name>
              <bitRange>[11:11]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM8_OC5_CLR</name>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIM8_OC6_CLR</name>
              <bitRange>[13:13]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HRPWM_SCOUT_CLR</name>
              <bitRange>[14:14]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CPUHALT_CLR</name>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPGA_SFO_DBG</name>
          <addressOffset>0x3F0</addressOffset>
          <fields>
            <field>
              <name>SFO_DEBUG</name>
              <bitRange>[2:0]</bitRange>
            </field>
          </fields>
        </register>
