breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>OPA</name>
      <baseAddress>0x40017000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>OPA1_CSR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>OPA1_EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OPA1_VPSEL</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OPA1_VNSEL</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OPA1_INTOEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OPA1_EXTOEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OPA1_MODE</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>OPA1_PGA_GAIN</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>OPA_VBIAS</name>
              <bitRange>[26:23]</bitRange>
            </field>
            <field>
              <name>OPA_VREF_SEL</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>OPA1_VBSEL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>OPA1_LOCK</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPA2_CSR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>OPA2_EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OPA2_VPSEL</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OPA2_VNSEL</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>OPA2_INTOEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OPA2_EXTOEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OPA2_PGA_GAIN</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>OPA2_VBSEL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>OPA2_LOCK</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPA3_CSR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>OPA3_EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OPA3_VPSEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>OPA3_VNSEL</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>OPA3_INTOEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OPA3_EXTOEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OPA3_MODE</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>OPA3_PGA_GAIN</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>OPA3_VBSEL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>OPA3_LOCK</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPA4_CSR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>OPA4_EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>OPA4_VNSEL</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>OPA4_INTOEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OPA4_EXTOEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OPA4_MODE</name>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>OPA4_PGA_GAIN</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>OPA4_VBSEL</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>OPA4_LOCK</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LPMS_ACTIVE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>LPMS_SLP</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>VR_MODE_SLP</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>DBP</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FLS_WUPT</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MR_VSEL</name>
              <bitRange>[17:16]</bitRange>
            </field>
            <field>
              <name>HSION_CTRL</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>STDBY_MRRDY_WAIT</name>
              <bitRange>[27:26]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>PVDE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PVDT</name>
              <bitRange>[3:1]</bitRange>
            </field>
            <field>
              <name>PVD_OUT_SEL</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>FLTEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>FLT_CTRL</name>
              <bitRange>[11:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>EWUPX</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>RRS</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR4</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>EWUPX</name>
              <bitRange>[9:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>WUFX</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>SBF</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PVDO</name>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MR_RDY</name>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>CWUFX</name>
              <bitRange>[4:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CSBF</name>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
