breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RCC</name>
      <description>desc RCC</description>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RCC_CTC</name>
        <description>RCC global Interrupt</description>
        <value>5</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>clock control register</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>HSION</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>HSIKERON</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>HSIRDY</name>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIDIV</name>
              <bitRange>[13:11]</bitRange>
            </field>
            <field>
              <name>HSEON</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>HSERDY</name>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSEBYP</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>HSECSSON</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PLLON</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>PLLRDY</name>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSCR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>HSI_TRIMCR</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>HSI_FS</name>
              <bitRange>[17:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR1</name>
          <description>clock configuration register 1</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>SW</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>SWS</name>
              <bitRange>[5:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HPRE</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>PPRE1</name>
              <bitRange>[15:12]</bitRange>
            </field>
            <field>
              <name>MCO1SEL</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>MCO1PRE</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>MCO2SEL</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>MCO2PRE</name>
              <bitRange>[31:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>desc CFGR2</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>PPRE2</name>
              <bitRange>[11:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PLLCFGR1</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PLLSRC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PLLMUL</name>
              <bitRange>[5:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECSCR</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>HSE_DRV</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>HSE_RDYSEL</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>HSE_FILT_ENB</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIER</name>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>LSIRDYIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>HSIRDYIE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HSERDYIE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>PLLRDYIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CIFR</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>LSIRDYF</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSIRDYF</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSERDYF</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PLLRDYF</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HSECSSF</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CICR</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>LSIRDYC</name>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HSIRDYC</name>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HSERDYC</name>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>PLLRDYC</name>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HSECSSC</name>
              <bitRange>[8:8]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBRSTR1</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>DMARST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CRCRST</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBRSTR2</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>GPIOARST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBRST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOCRST</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GPIODRST</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR1</name>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>TIM1RST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIM2RST</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIM3RST</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIM6RST</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TIM7RST</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TIM8RST</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR2</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>HRPWMRST</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR3</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>UART1RST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART2RST</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USARTRST</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LPUARTRST</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2CRST</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPIRST</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CANRST</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBRSTR4</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>SYSCFGRST</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VREFBUFRST</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PWRRST</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC1RST</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC2RST</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DACRST</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OPARST</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMPRST</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBENR1</name>
          <addressOffset>0x70</addressOffset>
          <fields>
            <field>
              <name>DMAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>FLASHSMEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SRAMSMEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CRCEN</name>
              <bitRange>[16:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBENR2</name>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>GPIOAEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>GPIOBEN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>GPIOCEN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>GPIODEN</name>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR1</name>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>TIM1EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIM2EN</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIM3EN</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIM6EN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TIM7EN</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TIM8EN</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR2</name>
          <addressOffset>0x84</addressOffset>
          <fields>
            <field>
              <name>HRPWMEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>WWDGEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR3</name>
          <addressOffset>0x88</addressOffset>
          <fields>
            <field>
              <name>UART1EN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART2EN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USARTEN</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LPUARTEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>I2CEN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>SPIEN</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CANEN</name>
              <bitRange>[28:28]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>APBENR4</name>
          <addressOffset>0x8C</addressOffset>
          <fields>
            <field>
              <name>SYSCFGEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BKPEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>VREFBUFEN</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PWREN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ADC1EN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ADC2EN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DACEN</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OPAEN</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMPEN</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR1</name>
          <addressOffset>0x98</addressOffset>
          <fields>
            <field>
              <name>USARTSEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>LPUARTSEL</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>COMP1SEL</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>COMP2SEL</name>
              <bitRange>[23:22]</bitRange>
            </field>
            <field>
              <name>COMP3SEL</name>
              <bitRange>[25:24]</bitRange>
            </field>
            <field>
              <name>COMP4SEL</name>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>TIMCLKCTRL</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>PVDSEL</name>
              <bitRange>[30:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR2</name>
          <addressOffset>0x9C</addressOffset>
          <fields>
            <field>
              <name>CANCKSEL</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>ADC12SEL</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADC12KEN</name>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR3</name>
          <addressOffset>0xA0</addressOffset>
          <fields>
            <field>
              <name>PLL_ADC_DIV</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PLL_CAN_DIV</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDCR</name>
          <description>Backup domain control register</description>
          <addressOffset>0xB0</addressOffset>
          <fields>
            <field>
              <name>BDRST</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>LSI_TRIMCR</name>
              <bitRange>[25:17]</bitRange>
            </field>
            <field>
              <name>LSION</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>LSIRDY</name>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>clock control &amp; status register</description>
          <addressOffset>0xB4</addressOffset>
          <fields>
            <field>
              <name>NRST_FLTDIS</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RMVF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PLLULRSTF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>OBLRSTF</name>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PINRSTF</name>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWRRSTF</name>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SFTRSTF</name>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WWDGRSTF</name>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LPWRRSTF</name>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
