breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <baseAddress>0x40002800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x60</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TAMPER</name>
        <description>Intrusion detection global interrupt</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <description>RTC global interrupt</description>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>CRH</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SECIE</name>
              <description>Second interrupt enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ALRIE</name>
              <description>Alarm interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OWIE</name>
              <description>Overflow interrupt enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CRL</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>SECF</name>
              <description>Second flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ALRF</name>
              <description>Alarm flag</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>OWF</name>
              <description>Overflow flag</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RSF</name>
              <description>Registers synchronized flag</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CNF</name>
              <description>Configuration flag</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RTOFF</name>
              <description>RTC operation OFF</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLH</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>PRL</name>
              <description>RTC pre-scaler reload value high part</description>
              <bitRange>[3:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRLL</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>PRL</name>
              <description>RTC pre-scaler reload value low part</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVH</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DIV</name>
              <description>RTC clock divider high part</description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVL</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>DIV</name>
              <description>RTC clock divider low part</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTH</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>CNT</name>
              <description>RTC counter high part</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNTL</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CNT</name>
              <description>RTC counter high part</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRH</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>ALR</name>
              <description>RTC alarm high part</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRL</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>ALR</name>
              <description>RTC alarm low part</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMPCFGR</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>TPE</name>
              <description>TAMP enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TPAL</name>
              <description>TAMPER pin interrupt enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TMPCSR</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>CTE</name>
              <description>clear TAMP event</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTI</name>
              <description>clear TAMP interrupt</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TPIE</name>
              <description>TAMP interrupt enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TEF</name>
              <description>TAMP event flag</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TIF</name>
              <description>TAMP interrupt flag</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALIBR</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>CAL</name>
              <description>RTC calibration value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>CCO</name>
              <description>Calibration clock output</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ASOE</name>
              <description>Alarm or second output enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ASOS</name>
              <description>Alarm or second output selection</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BKPDR0</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word0</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BKPDR1</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word1</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BKPDR2</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word2</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BKPDR3</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word3</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BKPDR4</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>D</name>
              <description>bakeup data word4</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
