breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global Interrupt</description>
        <value>35</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x50</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>I2C_FMP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_FLTEN</name>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CLL</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PVDL</name>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR3</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DMA_MAP1</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>DMA_MAP2</name>
              <bitRange>[14:8]</bitRange>
            </field>
            <field>
              <name>DMA_MAP3</name>
              <bitRange>[22:16]</bitRange>
            </field>
            <field>
              <name>DMA_MAP4</name>
              <bitRange>[30:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR4</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DMA_MAP5</name>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR1</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>EXTI0</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI1</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EXTI2</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI3</name>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR2</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>EXTI4</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI5</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EXTI6</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI7</name>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR3</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>EXTI8</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI9</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EXTI10</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI11</name>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EXTICR4</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>EXTI12</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>EXTI13</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>EXTI14</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>EXTI15</name>
              <bitRange>[13:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PAENS</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>PA_ENS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PBENS</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PB_ENS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCENS</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>PC_ENS</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PDENS</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>PD_ENS</name>
              <bitRange>[11:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TIM1</name>
      <groupName>TIM</groupName>
      <baseAddress>0x40012C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3F0</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIM1_BRK</name>
        <description>TIM1 Break Interrupt</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>TIM1_UP</name>
        <description>TIM1 Up Interrupt</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>TIM1_TRG_COM</name>
        <description>TIM1 Trigger and Communication Interrupt</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>TIM1_CC</name>
        <description>TIM1 Capture and Comparison Interrupt</description>
        <value>24</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UDIS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>URS</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OPM</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMS</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ARPE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKD</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>UIFREMAP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DITHEN</name>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CCPC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CCUS</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CCDS</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MMS_L</name>
              <bitRange>[6:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TI1S</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OIS1</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OIS1N</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OIS2</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OIS2N</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OIS3</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>OIS3N</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OIS4</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>OIS4N</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>OIS5</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OIS6</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>MMS2</name>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>MMS_H</name>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SMS_L</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCCS</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TS_L</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>MSM</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ETF</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ETPS</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>ECE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ETP</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SMS_H</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TS_H</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>SMSPE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>SMSPS</name>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>UIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC3IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC4IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UDE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC1DE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC2DE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3DE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4DE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>COMDE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TDE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>IDXIE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DIRIE</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>IERRIE</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TERRIE</name>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>UIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC3IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC4IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>B2IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC1OF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC2OF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3OF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4OF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SBIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CC5IF</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CC6IF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>IC1IR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>IC2IR</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IDXF</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>DIRF</name>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>IERRF</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TERRF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>IC3IR</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC4IR</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>UG</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CC1G</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CC2G</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CC3G</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CC4G</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>COMG</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TG</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BG</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>B2G</name>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1_OUTPUT</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>CC1S</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC1FE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC1PE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC1M_L</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>OC1CE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC2S</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OC2FE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC2PE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2M_L</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>OC2CE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>OC1M_H</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC2M_H</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1_INPUT</name>
          <alternateRegister>CCMR1_OUTPUT</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>CC1S</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC1PSC</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IC1F</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>CC2S</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2PSC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IC2F</name>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR2_OUTPUT</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CC3S</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC3FE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC3PE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC3M_L</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>OC3CE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC4S</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OC4FE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC4PE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC4M_L</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>OC4CE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>OC3M_H</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC4M_H</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
