breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
        <register>
          <name>AF1</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>BKINE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BKCMP1E</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BKCMP2E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BKCMP3E</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BKCMP4E</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BKINP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BKCMP1P</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BKCMP2P</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BKCMP3P</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BKCMP4P</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ETRSEL</name>
              <bitRange>[17:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AF2</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>BK2INE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BK2CMP1E</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BK2CMP2E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BK2CMP3E</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>BK2CMP4E</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BK2INP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BK2CMP1P</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BK2CMP2P</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BK2CMP3P</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BK2CMP4P</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OCRSEL</name>
              <bitRange>[18:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MTADCCR</name>
          <addressOffset>0x6C</addressOffset>
          <fields>
            <field>
              <name>MTZEROE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>MTARRE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>UMTCCR1E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>UMTCCR1HE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>UMTCCR2E</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UMTCCR2HE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>UMTCCR3E</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>UMTCCR3HE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UMTCCR4E</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>UMTCCR4HE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DMTCCR1E</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMTCCR1HE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>DMTCCR2E</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>DMTCCR2HE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>DMTCCR3E</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>DMTCCR3HE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>DMTCCR4E</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>DMTCCR4HE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>MTADCE</name>
              <bitRange>[18:18]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMXDCR</name>
          <addressOffset>0x3DC</addressOffset>
          <fields>
            <field>
              <name>DBA</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>DBL</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAR</name>
          <addressOffset>0x3E0</addressOffset>
          <fields>
            <field>
              <name>DMAB</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="TIM2">
      <name>TIM3</name>
      <baseAddress>0x40000400</baseAddress>
      <interrupt>
        <name>TIM3</name>
        <description>TIM3 global Interrupt</description>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>TIM6</name>
      <groupName>TIM</groupName>
      <baseAddress>0x40001000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIM6</name>
        <description>TIM6 global Interrupt</description>
        <value>27</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UDIS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>URS</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OPM</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ARPE</name>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>MMS</name>
              <bitRange>[6:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>UIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UDE</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>UIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>UG</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PSC</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>ARR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
