breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART2</name>
      <baseAddress>0x40005000</baseAddress>
      <interrupt>
        <name>UART2</name>
        <description>UART2 global Interrupt</description>
        <value>38</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>USART</name>
      <baseAddress>0x40013800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USART</name>
        <description>USART global Interrupt</description>
        <value>36</value>
      </interrupt>
      <registers>
        <register>
          <name>SR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>PE</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FE</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>NE</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ORE</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TC</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXE</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LBD</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CTS</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ABRF</name>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRE</name>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ABRRQ</name>
              <bitRange>[12:12]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TXFT</name>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFT</name>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXFF</name>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXFE</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EOBF</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>RTOF</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TXPE</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>RXBUSY</name>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXBUSY</name>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WAIT_RPT</name>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BRR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DIV_FRA</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DIV_MAN</name>
              <bitRange>[15:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>SBK</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RWU</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>IDLEIE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RXNEIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TXEIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PEIE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>PS</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>PCE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>WAKE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>M0</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>UE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>M1</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MSB</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADDM7</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>SWAP</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>TXFTCFG</name>
              <bitRange>[21:19]</bitRange>
            </field>
            <field>
              <name>RXFTCFG</name>
              <bitRange>[24:22]</bitRange>
            </field>
            <field>
              <name>RX_INV</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TX_INV</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>DATA_INV</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ONEBIT</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>RXFRQ</name>
              <bitRange>[29:29]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TXFRQ</name>
              <bitRange>[30:30]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>FIFOEN</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>LBDL</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LBDIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>LBCL</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CPHA</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CPOL</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CLKEN</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>STOP</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>LINEN</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ADD</name>
              <bitRange>[22:15]</bitRange>
            </field>
            <field>
              <name>DEM</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DEP</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>RTOEN</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ERSW</name>
              <bitRange>[27:26]</bitRange>
            </field>
            <field>
              <name>REP_T</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>TREPEN</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>RREPEN</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR3</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>EIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>IREN</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>IRLP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HDSEL</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>NACK</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>SCEN</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>DMAR</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>DMAT</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RTSE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CTSE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CTSIE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OVER8</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ABREN</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ABRMOD</name>
              <bitRange>[14:13]</bitRange>
            </field>
            <field>
              <name>RXFFIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TXFEIE</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>RXFTIE</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TXFTIE</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DEDT</name>
              <bitRange>[23:19]</bitRange>
            </field>
            <field>
              <name>DEAT</name>
              <bitRange>[28:24]</bitRange>
            </field>
            <field>
              <name>RTOIE</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>EOBIE</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GTPR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>PSC</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>GT</name>
              <bitRange>[15:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RTOR</name>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>RTO</name>
              <bitRange>[23:0]</bitRange>
            </field>
            <field>
              <name>BLEN</name>
              <bitRange>[31:24]</bitRange>
            </field>
          </fields>
        </register>
