breaveboy/AiKeyBoard/example/USBD_Keyboard/EIDE/.pack/Puya/PY32F4xx_DFP.1.0.6/CMSIS/SVD/PY32F420xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VREFBUF</name>
      <baseAddress>0x40012000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>VREFBUFEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>VREFBUFSEL</name>
              <bitRange>[3:1]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WWDG</name>
      <baseAddress>0x40002C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WWDG</name>
        <description>Window WatchDog global Interrupt</description>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>WWDR_CR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>T</name>
              <description>wwdg counter</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>WDGA</name>
              <description>WWDG Activation</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>W</name>
              <description>window value</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>WDGTB</name>
              <description>time base</description>
              <bitRange>[8:7]</bitRange>
            </field>
            <field>
              <name>EWI</name>
              <description>Early wakeup interrupt</description>
              <bitRange>[9:9]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>EWIF</name>
              <description>Early wakeup interrupt flag</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>